Public Member Functions | List of all members
ACAPI::MEP::ElbowDefault::Modifier Class Reference
MEP Element Manager
Modifier of the ElbowDefault. More...
#include <MEPElbowDefault.hpp>
 Inheritance diagram for ACAPI::MEP::ElbowDefault::Modifier:
 Public Member Functions
Result< void >  | SetFactorRadius (double factor)
Sets the factor of the radius of the ElbowDefault in the case of Duct and Cable Carrier.
Result< void >  | SetPreferenceTable (const UniqueID &tableId)
Sets the PreferenceTable of the ElbowDefault in the case of Duct and Pipe. This PreferenceTable will be transferred into the Elbows when a route is placed or modified.
 Public Member Functions inherited from ACAPI::MEP::ElementDefault::Modifier
 void  | RemoveInsulation ()
Removes the insulation.
Result< void >  | SetInsulationThickness (double insulationThickness)
Sets the thickness of insulation on the ElementDefault.
void  | SetObjectId (const API_Guid &libraryPartId)
Sets the referenced library part of the ElementDefault.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::ElementDefault::Modifier
Modifier (ElementDefault &parent)
Constructs a Modifier with the given parent ElementDefault.
Detailed Description
Modifier of the ElbowDefault.
Member Function Documentation
◆ SetFactorRadius()
 Result< void > ACAPI::MEP::ElbowDefault::Modifier::SetFactorRadius  |  ( |  double |  factor | )
Sets the factor of the radius of the ElbowDefault in the case of Duct and Cable Carrier.
Parameters
factor | The value to be set. Needs to be larger than 0.6.
Returns
Returns an error in case of PipeElbow or if the factor parameter is too small, otherwise nothing.
◆ SetPreferenceTable()
 Result< void > ACAPI::MEP::ElbowDefault::Modifier::SetPreferenceTable  |  ( |  const UniqueID & |  tableId | )
Sets the PreferenceTable of the ElbowDefault in the case of Duct and Pipe. This PreferenceTable will be transferred into the Elbows when a route is placed or modified.
Parameters
tableId | The UniqueID referring to the PreferenceTable to be set.
Returns
Returns an error in the case of Cable Carrier Elbow or if the referred ElbowTable can not be found, otherwise nothing.